clarenceliu/Mplib/Toshaba/TMPM36B/cmsis_lib/lib/src/tmpm36b_rtc.c
    /* Get minute value */
    TimeStruct->Min = RTC_GetMin(RTC_CLOCK_MODE);
    /* Get second value */
    TimeStruct->Sec = RTC_GetSec();
}

/**
  * @brief  Set the RTC alarm date and time.
  * @param  AlarmStruct: The structure containing basic alarm configuration.
  * @retval None
  */
void RTC_SetAlarmValue(RTC_AlarmTypeDef * AlarmStruct)
{
    uint8_t HourMode;
    HourMode = RTC_GetHourMode();

    /* Check the parameters */
    assert_param(IS_POINTER_NOT_NULL(AlarmStruct));
    assert_param(IS_RTC_DATE(AlarmStruct->Date));
    assert_param(IS_RTC_DAY(AlarmStruct->Day));

    if (HourMode == RTC_24_HOUR_MODE) {
        assert_param(IS_RTC_HOUR_24(AlarmStruct->Hour));
    } else {
        assert_param(IS_RTC_HOUR_12(AlarmStruct->Hour));
        assert_param(IS_RTC_AMPM_MODE(AlarmStruct->AmPm));
    }

    assert_param(IS_RTC_MINUTE(AlarmStruct->Min));

    /* Set date value */
    RTC_SetDate(RTC_ALARM_MODE, AlarmStruct->Date);
    /* Set day value */
    RTC_SetDay(RTC_ALARM_MODE, AlarmStruct->Day);

    /* Set hour value */
    if (HourMode == RTC_12_HOUR_MODE) {
        RTC_SetHour12(RTC_ALARM_MODE, AlarmStruct->Hour, AlarmStruct->AmPm);
    } else {
        RTC_SetHour24(RTC_ALARM_MODE, AlarmStruct->Hour);
    }

    /* Set minute value */
    RTC_SetMin(RTC_ALARM_MODE, AlarmStruct->Min);
}

/**
  * @brief  Get the RTC alarm date and time.
  * @param  AlarmStruct: The structure containing basic alarm configuration will be modified.
  * @retval None
  */
void RTC_GetAlarmValue(RTC_AlarmTypeDef * AlarmStruct)
{
    uint8_t HourMode;

    /* Check the parameters */
    assert_param(IS_POINTER_NOT_NULL(AlarmStruct));

    HourMode = RTC_GetHourMode();

    /* Get date value */
    AlarmStruct->Date = RTC_GetDate(RTC_ALARM_MODE);
    /* Get day value */
    AlarmStruct->Day = RTC_GetDay(RTC_ALARM_MODE);
    /* Get hour value */
    AlarmStruct->Hour = RTC_GetHour(RTC_ALARM_MODE);

    if (HourMode == RTC_12_HOUR_MODE) {
        /* Get AM/PM mode */
        AlarmStruct->AmPm = RTC_GetAMPM(RTC_ALARM_MODE);
    } else {
        AlarmStruct->AmPm = RTC_AMPM_INVALID;
    }

    /* Get minute value */
    AlarmStruct->Min = RTC_GetMin(RTC_ALARM_MODE);
}

/**
  * @brief  Enable or disable Clock correction function register protection
  * @param  NewState: New state of the RTC protect register
  *   This parameter can be one of the following values:
  *   DISABLE or ENABLE
  * @retval None
  */
void RTC_SetProtectCtrl(FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    /* Set RTCPROTECT */
    if (NewState == ENABLE) {
        TSB_RTC->PROTECT = RTC_PROTECT_SET;
    } else {
        TSB_RTC->PROTECT = RTC_PROTECT_CLEAR;
    }
}

/**
  * @brief  Enable RTC correction function.
  * @param  None
  * @retval None
  */
void RTC_EnableCorrection(void)
{
    uint8_t tmp = 0U;

    /* Set RTCADJCTL<AJEN> to enable correction function */
    tmp = TSB_RTC->ADJCTL;
    tmp &= ADJCTL_AJEN_CLEAR;
    tmp |= ADJCTL_AJEN_SET;
    TSB_RTC->ADJCTL = tmp;
}

/**
  * @brief  Disable RTC correction function.
  * @param  None
  * @retval None
  */
void RTC_DisableCorrection(void)
{
    uint8_t tmp = 0U;

    /* Clear RTCADJCTL<AJEN> to disable correction function */
    tmp = TSB_RTC->ADJCTL;
    tmp &= ADJCTL_AJEN_CLEAR;
    TSB_RTC->ADJCTL = tmp;
}

/**
  * @brief  Set correction reference time.
  * @param  Time: Correction reference time
  *   This parameter can be one of following values:
  *   RTC_ADJ_TIME_1_SEC, RTC_ADJ_TIME_10_SEC, 
  *   RTC_ADJ_TIME_20_SEC, RTC_ADJ_TIME_30_SEC,
  *   RTC_ADJ_TIME_1_MIN
  * @retval None
  */
void RTC_SetCorrectionTime(uint8_t Time)
{
    uint8_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_RTC_ADJ_TIME(Time));

    /* Set RTCADJCTL<AJSEL> */
    tmp = TSB_RTC->ADJCTL;
    tmp &= ADJCTL_AJSEL_CLEAR;
    tmp |= Time;
    TSB_RTC->ADJCTL = tmp;
}

/**
  * @brief  Set correction value.
  * @param  Mode: The mode of correction 
  *   This parameter can be one of following values:
  *   RTC_CORRECTION_PLUS, RTC_CORRECTION_MINUS
  * @param  Cnt:The value of correction
  *   This parameter can be 0~255 when Mode is RTC_CORRECTION_PLUS.
  *   This parameter can be 1~256 when Mode is RTC_CORRECTION_MINUS.
  * @retval None
  */
void RTC_SetCorrectionValue(RTC_CorrectionMode Mode, uint16_t Cnt)
{
    uint16_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_RTC_CORRECTION_MODE(Mode));
    if (Mode == RTC_CORRECTION_PLUS) {
        /* Check the parameters */
        assert_param(IS_RTC_PLUS_VALUE(Cnt));

        /* Set RTCADJDAT<ADJDAT> */
        TSB_RTC->ADJDAT = Cnt;
    } else {
        /* Check the parameters */
        assert_param(IS_RTC_MINUS_VALUE(Cnt));

        /* Set RTCADJDAT<ADJDAT> */
        tmp |= ADJDAT_MODE_SET;
        tmp |= (~(Cnt - 1U));
        tmp &= ADJDAT_CLEAR;
        TSB_RTC->ADJDAT = tmp;
    }
}

/** @} */
/* End of group RTC_Exported_Functions */

/** @} */
/* End of group RTC */

/** @} */
/* End of group TX03_Periph_Driver */
#endif                          /* defined(__TMPM36B_RTC_H) */
